//
//  LyricsXAppCore.swift
//  LyricsX - https://github.com/ddddxxx/LyricsX
//
//  This Source Code Form is subject to the terms of the Mozilla Public
//  License, v. 2.0. If a copy of the MPL was not distributed with this
//  file, You can obtain one at https://mozilla.org/MPL/2.0/.
//

import LyricsCore

extension Lyrics {
    public static let sample = Lyrics("""
    [total:168646]
    [by:ttpod]
    [ti:(F**k a) Silver Lining]
    [ar:Panic! At The Disco]
    [offset:0]
    [00:00.303](F**k a) Silver Lining - Panic! At The Disco
    [00:00.303][tr]去他的一线希望 - Panic! At The Disco
    [00:00.303][tt]<0,0><150,6><251,9><402,16><554,23><655,25><807,32><907,35><1058,39><1209,44>
    [00:02.642]To the old and to the new
    [00:02.642][tr]无论老少
    [00:02.642][tt]<0,0><151,3><302,7><1512,11><1713,15><1865,18><1965,22><2270,25>
    [00:06.108]We dedicate this song to you
    [00:06.108][tr]我们把这首歌献给你
    [00:06.108][tt]<0,0><203,3><1564,12><1716,17><2521,22><2673,25><2925,28>
    [00:12.451]Fk a silver lining
    [00:12.451][tr]去他的一线希望
    [00:12.451][tt]<0,0><150,3><503,5><1004,12><1557,18>
    [00:14.816]Fk a silver lining
    [00:14.816][tr]去他的一线希望
    [00:14.816][tt]<0,0><153,3><406,5><860,12><1312,18>
    [00:16.865]'Cause only gold is hot enough hot enough
    [00:16.865][tr]因为只有金子才足够炽热闪耀
    [00:16.865][tt]<0,0><217,7><621,12><2888,17><3038,20><3390,24><3795,31><4047,35><4450,41>
    [00:21.671]Fk a silver lining
    [00:21.671][tr]去他的一线希望
    [00:21.671][tt]<0,0><200,3><352,5><956,12><1359,18>
    [00:23.835]Fk a silver lining
    [00:23.835][tr]去他的一线希望
    [00:23.835][tt]<0,0><100,3><402,5><907,12><1462,18>
    [00:26.154]'Cause only gold is hot enough hot enough
    [00:26.154][tr]因为只有金子才足够炽热闪耀
    [00:26.154][tt]<0,0><151,7><453,12><2673,17><2824,20><3279,24><3582,31><3885,35><4338,41>
    [00:31.392]One more one more
    [00:31.392][tr]再来一点 再来一点
    [00:31.392][tt]<0,0><151,4><707,9><958,13><1311,17>
    [00:33.207]It's just cherries cherries
    [00:33.207][tr]只想拥有美好的事物
    [00:33.207][tt]<0,0><151,5><303,10><1159,19><1814,27>
    [00:35.221]Everything is cherries on top
    [00:35.221][tr]一切都是锦上添花才好
    [00:35.221][tt]<0,0><353,11><506,14><1260,23><1463,26><1866,29>
    [00:37.524]No wings of wax or endless mountains
    [00:37.524][tr]没有蜡质的翅膀或无尽的山脉
    [00:37.524][tt]<0,0><199,3><352,9><502,12><905,16><1106,19><1562,27><2218,36>
    [00:39.994]Tragedies with penniless fountains
    [00:39.994][tr]不幸的悲剧和没有硬币的喷泉
    [00:39.994][tt]<0,0><353,10><757,15><1311,25><2017,34>
    [00:42.212]It's just cherries cherries
    [00:42.212][tr]只想拥有美好的事物
    [00:42.212][tt]<0,0><202,5><403,10><1262,19><1918,27>
    [00:44.332]It's coming up cherries on top
    [00:44.332][tr]一切都是锦上添花才好
    [00:44.332][tt]<0,0><153,5><405,12><607,15><1363,24><1514,27><1917,30>
    [00:46.706]Sunset shadows through the trophies
    [00:46.706][tr]夕阳西下 奖杯投下一片阴影
    [00:46.706][tt]<0,0><454,7><1060,15><1261,23><1514,27><2117,35>
    [00:49.112]I guess it just aingt big enough
    [00:49.112][tr]我想只是因为阳光还不够烈
    [00:49.112][tt]<0,0><151,2><302,8><452,11><655,16><906,22><1309,26><1762,32>
    [00:51.160]Say it one more one more one more
    [00:51.160][tr]大声呼喊 再来一点光 掩盖阴暗
    [00:51.160][tt]<0,0><201,4><608,7><859,11><1460,16><1712,20><2319,25><2521,29><3027,33>
    [00:55.951]Fk a silver lining
    [00:55.951][tr]去他的一线希望
    [00:55.951][tt]<0,0><203,3><556,5><861,12><1314,18>
    [00:58.229]Fk a silver lining
    [00:58.229][tr]去他的一线希望
    [00:58.229][tt]<0,0><201,3><403,5><856,12><1358,18>
    [01:00.442]'Cause only gold is hot enough hot enough
    [01:00.442][tr]因为只有金子才足够炽热闪耀
    [01:00.442][tt]<0,0><151,7><559,12><2626,17><2776,20><3229,24><3943,31><4094,35><4447,41>
    [01:05.131]Fk a silver lining
    [01:05.131][tr]去他的一线希望
    [01:05.131][tt]<0,0><152,3><402,5><804,12><1309,18>
    [01:07.196]Fk a silver lining
    [01:07.196][tr]去他的一线希望
    [01:07.196][tt]<0,0><152,3><555,5><958,12><1511,18>
    [01:09.565]'Cause only gold is hot enough hot enough
    [01:09.565][tr]因为只有金子才足够炽热闪耀
    [01:09.565][tt]<0,0><152,7><504,12><2622,17><2774,20><3075,24><3631,31><3934,35><4336,41>
    [01:14.255]It's just cherries cherries
    [01:14.255][tr]只想拥有美好的事物
    [01:14.255][tt]<0,0><200,5><352,10><1107,19><1863,27>
    [01:16.320]Everything is cherries on top
    [01:16.320][tr]一切都是锦上添花才好
    [01:16.320][tt]<0,0><403,11><553,14><1306,23><1458,26><1911,29>
    [01:18.483]It's just cherries cherries
    [01:18.483][tr]只想拥有美好的事物
    [01:18.483][tt]<0,0><303,5><605,10><1615,19><2221,27>
    [01:20.907]Everything is cherries on top
    [01:20.907][tr]一切都是锦上添花才好
    [01:20.907][tt]<0,0><350,11><500,14><1257,23><1408,26><3027,29>
    [01:24.084]One more one more
    [01:24.084][tr]再来一点 再来一点
    [01:24.084][tt]<0,0><200,4><604,9><856,13><1210,17>
    [01:25.697]We've been falling falling
    [01:25.697][tr]我们一直在坠落 坠落
    [01:25.697][tt]<0,0><150,6><351,11><1315,19><1768,26>
    [01:27.648]It's like we fell to the top
    [01:27.648][tr]我们仿佛从天堂堕入地狱
    [01:27.648][tt]<0,0><151,5><353,10><604,13><957,18><1208,21><1460,25><1964,28>
    [01:30.168]I was born to cut a million
    [01:30.168][tr]我注定会名利双收
    [01:30.168][tt]<0,0><201,2><453,6><1058,11><1209,14><1361,18><1562,20><2117,27>
    [01:32.537]Cut my teeth and made a killing
    [01:32.537][tr]我年幼闯荡 大赚一票
    [01:32.537][tt]<0,0><150,4><352,7><754,13><905,17><1158,22><1359,24><1913,31>
    [01:34.751]Now I'm dodging dodging
    [01:34.751][tr]现在我转身躲避 转身躲避
    [01:34.751][tt]<0,0><203,4><454,8><1211,16><1865,23>
    [01:36.836]Everything you think that I'm not
    [01:36.836][tr]你以为我什么都做不到
    [01:36.836][tt]<0,0><252,11><554,15><857,21><1162,26><1517,30><1970,33>
    [01:39.512]Archetype of television
    [01:39.512][tr]拨开那层迷雾
    [01:39.512][tt]<0,0><657,10><806,13><1814,23>
    [01:41.589]Was lost in thought but held my vision hey
    [01:41.589][tr]陷入了沉思 却吸引了我的目光
    [01:41.589][tt]<0,0><202,4><352,9><451,12><856,20><1057,24><1257,29><1559,32><2218,39><2669,42>
    [01:45.552]When you gonna say my name
    [01:45.552][tr]你何时会喊出我的名字
    [01:45.552][tt]<0,0><201,5><351,9><502,15><755,19><906,22><1615,26>
    [01:47.872]When you gonna say my name
    [01:47.872][tr]你何时会喊出我的名字
    [01:47.872][tt]<0,0><202,5><353,9><505,15><705,19><856,22><1608,26>
    [01:50.271]Quick charade Beyoncé Lemonade
    [01:50.271][tr]快速猜谜游戏 碧昂丝专辑《柠檬水》
    [01:50.271][tt]<0,0><152,6><1105,14><1258,20><2316,22><2921,30>
    [01:54.953]When you gonna say my name
    [01:54.953][tr]你何时会喊出我的名字
    [01:54.953][tt]<0,0><153,5><253,9><405,15><656,19><807,22><1260,26>
    [01:57.121]When you gonna say my name
    [01:57.121][tr]你何时会喊出我的名字
    [01:57.121][tt]<0,0><152,5><302,9><452,15><706,19><805,22><1361,26>
    [01:59.392]No delay no halfway let me hear you say
    [01:59.392][tr]别再推迟 别再拖延 让我听到你说
    [01:59.392][tt]<0,0><150,3><756,9><1159,12><2014,20><2164,24><2316,27><2469,32><2670,36><3222,39>
    [02:02.868]One more one more one more
    [02:02.868][tr]再来一点 再来一点 再来一点
    [02:02.868][tt]<0,0><151,4><655,9><859,13><1515,18><1716,22><2170,26>
    [02:07.253]Silver lining
    [02:07.253][tr]一线希望
    [02:07.253][tt]<0,0><555,7><1008,13>
    [02:09.117]Fk a silver lining
    [02:09.117][tr]去他的一线希望
    [02:09.117][tt]<0,0><152,3><505,5><808,12><1363,18>
    [02:11.287]'Cause only gold is hot enough hot enough
    [02:11.287][tr]因为只有金子才足够炽热闪耀
    [02:11.287][tt]<0,0><152,7><638,12><2649,17><2800,20><3252,24><3703,31><3955,35><4409,41>
    [02:16.001]Fk a silver lining
    [02:16.001][tr]去他的一线希望
    [02:16.001][tt]<0,0><152,3><452,5><706,12><1359,18>
    [02:18.117]Fk a silver lining
    [02:18.117][tr]去他的一线希望
    [02:18.117][tt]<0,0><150,3><451,5><903,12><1456,18>
    [02:20.428]'Cause only gold is hot enough hot enough
    [02:20.428][tr]因为只有金子才足够炽热闪耀
    [02:20.428][tt]<0,0><151,7><503,12><2567,17><2655,20><3008,24><3610,31><3913,35><4415,41>
    [02:25.149]It's just cherries cherries
    [02:25.149][tr]只想拥有美好的事物
    [02:25.149][tt]<0,0><151,5><352,10><1315,19><1870,27>
    [02:27.272]Everything is cherries on top
    [02:27.272][tr]一切都是锦上添花才好
    [02:27.272][tt]<0,0><302,11><503,14><1158,23><1309,26><1914,29>
    [02:29.690]It's just cherries cherries
    [02:29.690][tr]只想拥有美好的事物
    [02:29.690][tt]<0,0><150,5><400,10><1361,19><1963,27>
    [02:31.805]Everything is cherries on top
    [02:31.805][tr]一切都是锦上添花才好
    [02:31.805][tt]<0,0><251,11><452,14><1191,23><1444,26><2902,29>
    [02:34.908]Silver lining
    [02:34.908][tr]一线希望
    [02:34.908][tt]<0,0><252,7><654,13>
    [02:36.368]Fk a silver lining
    [02:36.368][tr]去他的一线希望
    [02:36.368][tt]<0,0><200,3><675,5><978,12><1481,18>
    [02:38.634]'Cause only gold is hot enough hot enough
    [02:38.634][tr]因为只有金子才足够炽热闪耀
    [02:38.634][tt]<0,0><201,7><705,12><2672,17><2823,20><3175,24><3731,31><4032,35><4489,41>
    """)!
}


